Revit 2026 API

# PlasticVinylPlasticvinylPattern Property

---

The property labeled "Relief Pattern" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylPattern { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylPattern As String
	Get
```
```cpp
public:
static property String^ PlasticvinylPattern {
	String^ get ();
}
```
```fsharp
static member PlasticvinylPattern : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylPatternType".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace